FemDesign.Results.ResultsReader
Reads FEM-Design results from list tables text files.

FemDesign.Results.ResultsReader.#ctor(System.String)
filePath: Path to a .txt/.csv file with listed results from FEM-Design

FemDesign.Results.ResultsReader.ParseAll
Parses all of a results file. Returns a mixed list of all results in file.
Returns:

FemDesign.Results.ResultsReader.Parse(System.String)
Parses all of a results file. Returns a mixed list of all results in file.
resultsFilePath: Results file.
Returns:

FemDesign.Results.ResultsReader.SniffResultType
Tries to figure out the corresponding type of the upcoming lines that are being read.
Returns: